package com.luchshyisbornikanegotov.collectionofjokes;

public class CollectionOfJokes {
    static String[] jokes1 = new String[]{
            "Мать Вовочки: \n" +
                    "– Смотри, как ревёт! И сегодня придётся его забирать из кроватки и класть спать с собой!\n" +
                    "Отец Вовочки:\n" +
                    "– Эх, черт! Когда это кончится!\n" +
                    "Вовочка (мысленно): \n" +
                    "– А никогда! Вас оставь одних, сделаете братика или сестрёнку. Потом  всю жизнь делись с ними конфетами!",
            "Встреча выпускников лет через 30. В класс под руки практически вносят\n" +
                    "убелённую сединами Марь Иванну, она смотрит на всех, и сквозь слёзы\n" +
                    "радуется:\n" +
                    "– Родные вы мои, вы мой самый любимый класс за все годы, ой, посмотрите,\n" +
                    "кто кем сейчас стал, вот Машенька Иванова-светило медицины, Витенька\n" +
                    "Петров-дипломат, Сёмочка Шлемензон-доктор наук, и даже Вовочка, наш Вовочка, который всю школу просидел за задней партой и который никогда ничего не знал – и тот стал генералом!\n" +
                    "Из-за последней парты поднимается раскабаневший Вовочка в генеральском мундире и оглядывает всех подвыпившим взглядом:”А Я И СЕЙЧАС НИЧЕГО НЕ ЗНАЮ, НО ЧТОБ К УТРУ ВСЁ БЫЛО СДЕЛАНО!”",
            "Пpиходит Вовочка в пеpвый класс.\n" +
                    "— А ты считать умеешь? — интеpесуется учительница.\n" +
                    "В: — Один, два, тpи, четыpе, пять, шесть, семь…\n" +
                    "Училка: — А дальше знаешь?\n" +
                    "В: — … восемь, девять, десять, валет, дама, коpоль, туз…",
            "Первое сентября, первый класс. Учительница говорит:\n" +
                    "— Дети, вы пришли в школу. Здесь нужно сидеть тихо, а если что-то\n" +
                    "хотите спросить, поднимите руку.\n" +
                    "Вовочка тянет руку.\n" +
                    "— Ты что-то хочешь спросить, Вовочка?\n" +
                    "— Нет, просто проверяю, как работает система.",
            "В классе заболела учительница. Вовочке поручили навестить ее. На следующий день Вовочка входит в класс и объявляет:\n" +
                    "— Положение — безнадежное! Марь Ванна завтра придет в школу!",
            "Учительница:\n" +
                    "— Сегодня, дети, мы будем спрягать глаголы. Я стою, ты стоишь, он стоит, мы стоим, вы стоите, они стоят… Вовочка, повтори!\n" +
                    "— Все стоят",
            "— Вовочка, какие птицы самые полезные для человека?\n" +
                    "— Жареные, Марь Ивановна",
            "Вовочка сидит в парке на скамейке и ругается. Подходит Томочка (Т):\n" +
                    "Т: Что случилось?\n" +
                    "В: Садись рядом — расскажу.\n" +
                    "Томочка села.\n" +
                    "В: Понимаешь, какие-то редиски эту скамейку покрасили!",
            "Учительница рассказывает на уроке детям о животных. В конце урока\n" +
                    "она, проверяя, хорошо ли ученики усвоили материал, спрашивает:\n" +
                    "— Петенька, для чего нужна овца?\n" +
                    "— Чтобы давать шерсть.\n" +
                    "— Правильно. Машенька, для чего нужна курица?\n" +
                    "— Чтобы нести яйца.\n" +
                    "— Правильно. Вовочка, для чего нужна корова?\n" +
                    "— Чтобы задавать нам уроки!",
            "Сын говорит матери:\n" +
                    "— Я больше не пойду в школу!\n" +
                    "— Это почему же?\n" +
                    "— Да ну ее! Петров опять будет из рогатки стрелять, Синицын учебником по голове бить, Васильев подножки ставить… Не пойду!\n" +
                    "— Нет, Вовочка, успокойся, ты должен, просто обязан идти!\n" +
                    "Во-первых, тебе уже сорок лет, а во-вторых, ты — директор школы.",
            "- Вовочка, где твой школьный дневник?\n" +
                    "- Его Колька взял. Родителей пугать будет.",
            "-Вовочка,допустим,у тебя есть 100 рублей.Ты попросил у отца ещё 100 рублей. Сколько всего у тебя будет денег?\n" +
                    "-100 рублей, Марь Иванна.\n" +
                    "-Плохо,Вовочка ты совсем не знаешь математику!\n" +
                    "-А вы Марь Иванна совсем не знаете моего отца!",
            "Вовочка спрашивает в аптеке:\n" +
                    "- У вас есть какое-нибудь надежное обезболивающее средство?\n" +
                    "- Мальчик, а что у тебя болит?\n" +
                    "- Пока ничего, но папа уже ушел на родительское собрание.",
            "Вовочка приходит в класс с распухшей губой. Учительница:\n" +
                    "– Вовочка, что случилось?\n" +
                    "– Были с отцом на рыбалке, так оса на губу села.\n" +
                    "– И что, укусила?\n" +
                    "– Не, батя веслом убил!",
            "Вову ругает мама:\n" +
                    "-ты зачем Свету дурой обозвал, иди и попроси прощение.\n" +
                    "Подошол Вова к Свете и говорит:\n" +
                    "-Света мне очень жаль что ты дура"
    };
    static String[] jokes2 = new String[]{
            "На потолке висят летучие мыши. Все, как положено, головами вниз, а одна – головой вверх. Висящие по\n" +
                    "соседству мыши переговариваются:\n" +
                    "– Чего это она вверх головой висит?\n" +
                    "– А это она йогой занимается!",
            "У шимпанзе в зоопарке пропали бананы. Она повесила объявление: “Кто украл бананы? Найду – оторву лапы и уши! Шимпанзе”.\n" +
                    "На следующий день смотрит, а внизу подписано: “Спорим, не оторвёшь? Уж”.",
            "Пошёл кот ловить карасей, а приманку забыл. Написал на бумажке “червяк” и закинул удочку.\n" +
                    "Смотрит – КЛЮЁТ! Вытаскивает удочку, а на крючке бумажка с надписью “карась”.",
            "Человек выгуливает собаку. К нему подходит другой и спрашивает:\n" +
                    "– У вашего пса есть родословное дерево?\n" +
                    "– А зачем? Он пользуется любым.",
            "– Папа, а кто сильнее – наш кот Васька или бык?\n" +
                    "– Сынок, рассуждай логически. Ты видел кошачий корм с добавлением говядины?\n" +
                    "– Видел.\n" +
                    "– А коровий корм с добавлением котов?\n" +
                    "– Нет.\n" +
                    "– Делай выводы…",
            "Зима, лес, падает снег. По лесу ходит раздражённый медведь. То сломаёт ёлку, то пнёт дерево, то\n" +
                    "на волка наорёт… Короче, злой очень! Ходит и бормочет:\n" +
                    "– И зачем это я пил в сентябре кофе?!",
            "– Какая наглость, ваша собака съела нашу курицу!\n" +
                    "– Спасибо, что сказали, значит, теперь её можно не кормить!",
            "Говорят две обезьяны:\n" +
                    "– Как тебе мой новый друг?\n" +
                    "– Откровенно говоря, подруга, внешне мне он не очень понравился. Извини, но есть в нём что-то от человека.",
            "Кот удирает от собаки и думает: “Я сам за хомячком вчера по комнате гонялся, ему также страшно было,\n" +
                    "бедный хомячок, бедный пушистик…” Тут бац – дерево. Кот залез на дерево, отдышался, сидит и думает: “Ну, хомяк, теперь держись!”",
            "Разговор двух охотников:\n" +
                    "– Вчера встретил в лесу волка. Тощий такой, исхудал за зиму, просто кожа да кости. Успел убежать.\n" +
                    "– Волк?\n" +
                    "– Нет, я.",
            "Идёт муравей по лесу.\n" +
                    "Навстречу ему ящерица.\n" +
                    "Муравей удивлённо:\n" +
                    "– Ой, а ты кто?\n" +
                    "– Я – динозавр.\n" +
                    "– Так вы же вымерли!\n" +
                    "– Врут. Болели мы.",
            "Идёт заяц по лесу, видит – овца плачет.\n" +
                    "– Кто тебя обидел? Да я ему сейчас пасть порву!\n" +
                    "– Во-о-олк дерётся!\n" +
                    "– А-а-а-а, волк… Ну, наш серенький зря не обидит.",
            "Маленький ёжик заблудился в пустыне. Он бродил до поздней ночи, пока не наткнулся на кактус:\n" +
                    "– Мама, как ты выросла!!!",
            "Идёт лошадь по городу, видит в витрине соломенную шляпку. Заглядывает в магазин и просит:\n" +
                    "– Дайте посмотреть шляпку!\n" +
                    "– Вам какого размера?\n" +
                    "– Да мне всё равно, мне на завтрак!",
            "В телевизоре моего кота две телепрограммы: когда он сидит на подоконнике, он смотрит, что происходит на улице.\n" +
                    "Когда же я высаживаю его за окно, он смотрит, что происходит у меня дома."
    };
    static String[] jokes3 = new String[]{
            "Как говорил профессор кафедры, Ираклий Тенгизович:\n" +
                    "\"Жены старэют, а вот студэнткы 3-го курса - ныкогда!\"",
            "Студенческая общага. Один студент - другому:\n" +
                    "- Геша, будешь у меня репетитором?\n" +
                    "- Тут важно уловить тооооненькую грань... Можно просто помочь подучить английский, а быть репетитором - значит брать за это определённую плату!\n" +
                    "- Пельмешки?\n" +
                    "- По рукам!!!",
            "Студент Сидоров стал самым популярным среди одногруппниц. У него, единственного в общаге были ксерокс и стиралка.",
            "Студент выучил все билеты по философии, но не пошёл на экзамен, потому что жизнь не имеет смысла и все люди в ней пешки.\n" +
                    "\n",
            "Студент сдает экзамен, а препод его валит… \n" +
                    "— Ну хорошо, — говорит препод, — если отвечаешь на этот вопрос — то сдал… Сколько в этой аудитории лампочек? " +
                    "\nСтудет, быстро считая:" +
                    "\n — Девять! " +
                    "\nПрепод, доставая из кармана лампочку:" +
                    "\n — Неправильно! Лампочек десять. Придется тебе пересдавать… Пересдача, та же ситуация… Препод задает тот же вопрос… " +
                    "\nСтудент (не задумываясь):" +
                    "\n — Десять. " +
                    "\nПрепод с ехидной улыбкой:" +
                    "\n — Нет, неправильно, я сегодня лампочку не взял… " +
                    "\nСтудент вытаскивает лампочку из кармана: " +
                    "\n— Зато я взял!",
            "Приходит студент на экзамен с тремя бутылками коньяка и говорит профессору: " +
                    "\n- Прошу вас, пожалуйста, поставьте мне три! " +
                    "\n- Знаете юноша, я, пожалуй, возьму только две... ",
            "Экзамен по зоологии. Студент знает только про блох, но зато все. Профессор: " +
                    "\n- Расскажите о медведях. Студент: " +
                    "\n- Медведи живут в лесу, имеют шерсть, а вот в шерсти есть блохи. Кстати, о блохах... Профессор: " +
                    "\n- Ладно, поговорим о зайцах. Студент: " +
                    "\n- Зайцы тоже живут в лесу, и у них тоже есть шерсть, но что самое интересное, в шерсти живут блохи... Профессор: " +
                    "\n- Хорошо, хорошо. Верю. Расскажите хоть что-нибудь... Скажем про рыб. Студент: " +
                    "\n- Рыбы живут в воде, следовательно, шерсти нет, зато, если бы была... ",
            "На экзамене профессор спрашивает нерадивого студента: " +
                    "\n- Что такое экзамен? " +
                    "\n- Это беседа двух умных людей. " +
                    "\n- А если один из них идиот? " +
                    "\n- То второй не получает стипендию. ",
            "- Садитесь, пять. " +
                    "\n- А можно мы обойдёмся тремя? " +
                    "\n- Нет, только пять! " +
                    "\n- Ну хотя бы четыре... " +
                    "\n- Пять бутылок Хеннесси и я приму у вас зачётку, иначе идите договаривайтесь с военкоматом... ",
            "Приходит студент за зачётом, преподаватель говорит ему: " +
                    "\n— Вот Вам простенькая задачка. Сократите дробь косинус икс делить на котангенс икс. " +
                    "\nСтудент пишет в американской нотации сos(х)/сot(х) = ... " +
                    "\n— Хорошо, — говорит преподаватель, — дальше... " +
                    "\n— х в числителе и знаменателе сокращаем... остается сos/сot. " +
                    "\n— Хорошо, — говорит преподаватель, — дальше... " +
                    "\n— сo в числителе и знаменателе... " +
                    "\n— ОК, — говорит преподаватель... " +
                    "\n— s/t... Так это же скорость!",
            "— Что должен знать студент? " +
                    "\n— Всё! " +
                    "\n— А что должен знать лаборант? " +
                    "\n— Почти то же, что и студент. " +
                    "\n— А аспирант? " +
                    "\n— В какой книге находится то, что должен знать студент. " +
                    "\n— А доцент? " +
                    "\n— Где находится эта книга. " +
                    "\n— А профессор? " +
                    "\n— Где находится доцент.",
            "Первокласснику дали сто рублей. " +
                    "\n— Сто рублей! Я богат! " +
                    "\nШестикласснику дали сто рублей. " +
                    "\n— О, сто рублей. Хоть в макдак схожу. " +
                    "\nОдиннадцатикласснику дали сто рублей. " +
                    "\n— У, сто рублей. Разве это деньги? " +
                    "\nСтуденту дали сто рублей. " +
                    "\n— Сто рублей! Я богат!",
            "Препод принимает экзамен у первого курса института. Сидит, читает газетку, пока студенты готовятся. Зачитался, потом вспомнил про работу — быстро опустил газету. Резкий шорох убираемых шпор и невинные взгляды студентов. То же на втором курсе. Газета опускается — ноль эмоций, все сдирают дальше. Препод возмущенно: \"Грм!\". Все нехотя прячут шпаргалки. Экзамен на пятом курсе. Газета препода давно лежит на столе, он сам гневно сверлит глазами аудиторию — народу все пофиг. Наконец с задней парты раздается недовольное:\"Грм!\" Препод хватает газету и быстро закрывается ей.",
            "Разговор в студенческой общаге художественного ВУЗа, студенты собираются на практику: " +
                    "\n— Мольберт взял? " +
                    "\n— Взял. " +
                    "\n— Кисти взял? " +
                    "\n— Взял. " +
                    "\n— Краски взял? " +
                    "\n— Взял. " +
                    "\n— Политру взял? " +
                    "\n— Да я подумал по литру мало будет, взял по два.",
            "Экзамен. Все уже с билетами. Сидят. Явно переволновавшийся студент: " +
                    "\n— А писло чесать? " +
                    "\nПрепод: " +
                    "\n— Чешите, если поможет."
    };
    static String[] jokes4 = new String[]{
            "Забегает мужик в \"Спорттовары\"\n" +
                    "- Свежие удочки есть?\n" +
                    "- Есть но не свежие.\n" +
                    "- Нет, мне надо свежие, а то жена делает соус Анкл-Бенс, просит побеги молодого\n" +
                    "бамбука.",
            "Идет Собрание рыболовов-любителей Председатель:\n" +
                    "- В позапрошлом году, господа, мы на рыбалку брали по бутылке на брата -\n" +
                    "потеряли удочки. В прошлом - по две бутылке - потеряли автобус. Что будем делать\n" +
                    "в этом году? Голос из рядов:\n" +
                    "- Брать по три бутылки, но удочки не брать и из автобуса не выходить.",
            "Как-то раз, будучи в отпуске на Мальдивах, братки решили\n" +
                    "порыбачить. Взяли яхту напрокат, вышли в море и закинули\n" +
                    "удочки. Сидят, рыбачат. Вдруг к ним подруливает полицейский\n" +
                    "катер и оттуда кричат:\n" +
                    "- Эй, на яхте. У вас есть лицензия на отлов рыбы?\n" +
                    "- Не-а. Нету!\n" +
                    "- Тогда с вас штраф за лов рыбы без лицензии!!!\n" +
                    "- А мы и не ловим рыбу, мы \"зелёные\", мы очищаем дно бухты\n" +
                    "от всякого железного хлама.\n" +
                    "С этими словами они вытащили удочки и копы увидели,\n" +
                    "что на конце лесок привязано по большому магниту.\n" +
                    "Покрутив у виска, менты уплыли восвояси.\n" +
                    "На яхте:\n" +
                    "- Как здорово, что сёдня мы решили ловить Рыбу-Молота!!!",
            "Блондинка заходит в рыболовный магазин.\n" +
                    "- Скажите, у вас есть удочки для ловли рыбы?\n" +
                    "- Сколько угодно. Какую именно нужно?\n" +
                    "- Самую большую! А то муж с рыбалки одну мелочь приносит.",
            "На рыбалке главное не улов, а прикормка. Накормил рыбу и можешь домой отправляться.",
            "Муж уехал с друзьями на рыбалку. Через два дня появляется дома и протягивает жене пакет:\n" +
                    "— Вот, держи рыбу.\n" +
                    "— Так это же селедка!\n" +
                    "— Машина сломалась, а места там глухие — связи нет. Хорошо что у Василия оказался с собой килограмм соли. Делать нечего: ловили и солили, ловили и солили…",
            "Собирается мужик на рыбалку. Жена ему говорит:\n" +
                    "— Дорогой, не забудь удочку.\n" +
                    "— Да ну ее, еще потеряю…",
            "Приехать с рыбалки без пойманной рыбы не считается плохим тоном. А вот с недопитой водкой — это уже позор всей честной компании.",
            "Сидит на берегу реки рыбак-учитель. Поймал маленького сомика, снимает с крючка, отпускает его обратно в воду и говорит:\n" +
                    "— И чтобы без родителей не возвращался!",
            "— Надо человеку не рыбу давать, а научить ее ловить!\n" +
                    "— Моего научили.\n" +
                    "— И что?\n" +
                    "— Спился.",
            "— Скажите, как узнать, что перед вами настоящий морж?\n" +
                    "— Легко! Настоящие моржи купаются голыми.\n" +
                    "— То-есть, если кто-то купается в проруби в одежде, то это точно не морж?\n" +
                    "— Нет. Это рыбак.",
            "— А тебя жена на рыбалку отпускает?\n" +
                    "— Так мы вместе ездим. Ей нравится.\n" +
                    "— Она что, у тебя рыбу ловит?\n" +
                    "— Сперва ловила. Теперь вместе бухаем.",
            "Мужики рыбачат в лодке, вдруг рядом с ними выныривают синие киты.\n" +
                    "Один — другому:\n" +
                    "— Опять мужики не поверят, какого размера рыбка сорвалась.",
            "Дай человеку рыбу, и он наестся. Дай человеку удочку, и он нажрется.",
            "— Ходили тут вчера на рыбалку с ночевкой. Так Серега, чтобы с нами не пить, зашился.\n" +
                    "— Да ты что?\n" +
                    "— Представляешь?! В спальный мешок изнутри!",
    };
    static String[] jokes5 = new String[]{
            "На соревнованиях по плаванью электрик Петров замкнул тройку лидеров.",
            "Журналист спрашивает гонщика-победителя:\n" +
                    "- Как Вам удалось обойти столь опытных и именитых соперников? \n" +
                    "- Да просто тормоза отказали.",
            "Чемпионaт мирa по горным лыжaм. Чемпион  мчится с горы нa бешеной скорости. Тут его обгоняет русский со своими детьми. Тот в шоке. У подножия горы спрaшивaет:\n" +
                    "- Вaм не было стрaшно? \n" +
                    "- Мне нет, a детям немного. Они ведь у меня не пьют!",
            "- Дорогая, будешь смотреть фигурное катание по тв?\n" +
                    "- Давай! А кто катается?\n" +
                    "- Ну... ЦСКА и Монреаль!",
            "В купе вагона пожилая женщина обращается к атлетически сложенному попутчику:\n" +
                    "     - Молодой человек, вы не могли бы освободить для меня нижнюю полку?\n" +
                    "     - Могу! Вам в каком купе?",
            "- Врач сказал, что у меня врожденные способности к горнолыжному спорту.\n" +
                    "- В чем это выражается?\n" +
                    "- У меня быстро срастаются переломы.",
            "Полубокс - это когдa бьют только вaс.",
            "Гребля академическая: 8 гребцов и 1 рулевой.\n" +
                    "Гребля русская: 1 гребец и 8 рулевых.",
            "- Люди, которые делают утреннюю зарядку, умирают в сто раз реже остальных.\n" +
                    "- Почему?\n" +
                    "- Потому что их в сто раз меньше, чем остальных.",
            "Парень хвастается друзьям:\n" +
                    "- А я Наташе кольцо подарил. Теперь прыгает от радости.\n" +
                    "- Бриллиантовое?\n" +
                    "- Баскетбольное.",
            "- Дорогой, я сегодня смотрела по телевизору футбольный матч, который ты судил.\n" +
                    "- Ну и как?\n" +
                    "- Я уже записала тебя на прием к окулисту.",
            "- А что, матч-то отборочный?\n" +
                    "- Отборочный! Кто проиграет, у того все отберут!",
            "На последних соревнованиях по биатлону наш стрелок попал в тройку призеров, а конкретно - в серебряную медалистку.",
                    "Золотое правило боксера: \"Не смотри в сторону, - пропустишь самое интересное\"",
            "Скалолаз не тот, кто залез на скалу, а тот, кто потом спустился",
    };
}
